; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v3)
             (pred_9 ?v5 ?v6)
             (pred_6 ?v8 ?v6)
             (pred_2 ?v13 ?v8 )
	     (pred_11 ?v8)
             (pred_5 ?v2)
             (pred_12 ?v5)
             (pred_10 ?v6)
             (pred_4 ?v8)
             (pred_3 ?v5)
             (pred_7 ?v8)
             (pred_1 ))



(:action op_5
:parameters (?v4 ?v7 ?v9 ?v12)
:precondition (and (pred_5 ?v4) (pred_5 ?v7) (pred_12 ?v9) (pred_10 ?v12)
          (pred_8 ?v4 ?v7) (pred_9 ?v9 ?v12)
                   (pred_6 ?v7 ?v12) (pred_11 ?v4) 
                   (pred_4 ?v7) (pred_3 ?v9))
:effect (and  (pred_7 ?v7) (not (pred_4 ?v7))))


(:action op_2
:parameters (?v4 ?v1)
:precondition (and (pred_5 ?v4) (pred_5 ?v1)
               (pred_11 ?v4) (pred_8 ?v4 ?v1) (pred_7 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v4))))

(:action op_4
:parameters (?v4 ?v9)
:precondition (and (pred_5 ?v4) (pred_12 ?v9) 
                  (pred_11 ?v4) (pred_2 ?v9 ?v4) (pred_1 ))
:effect (and (pred_3 ?v9)
   (not (pred_2 ?v9 ?v4)) (not (pred_1 ))))


(:action op_3
:parameters (?v4 ?v11 ?v10)
:precondition (and (pred_5 ?v4) (pred_12 ?v11) (pred_12 ?v10)
                  (pred_11 ?v4) (pred_3 ?v10) (pred_2 ?v11 ?v4))
:effect (and (pred_3 ?v11) (pred_2 ?v10 ?v4)
        (not (pred_3 ?v10)) (not (pred_2 ?v11 ?v4))))

(:action op_1
:parameters (?v4 ?v9)
:precondition (and (pred_5 ?v4) (pred_12 ?v9) 
                  (pred_11 ?v4) (pred_3 ?v9))
:effect (and (pred_1 ) (pred_2 ?v9 ?v4) (not (pred_3 ?v9)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_22 obj_01 obj_24 obj_04 obj_18 obj_26 obj_14 obj_05 obj_21 obj_02 obj_08 obj_28 obj_12 obj_07 obj_15 obj_20 obj_13 obj_17 obj_27 obj_25 obj_31 obj_09 obj_06 obj_30
    obj_29 obj_16 obj_10
    obj_23 obj_03 obj_19
    )

    (:init
       (pred_1)

       (pred_5 obj_11)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_24)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_5 obj_26)
       (pred_5 obj_14)
       (pred_5 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_02)
       (pred_5 obj_08)
       (pred_5 obj_28)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_13)
       (pred_5 obj_17)
       (pred_5 obj_27)
       (pred_5 obj_25)
       (pred_5 obj_31)
       (pred_5 obj_09)
       (pred_5 obj_06)
       (pred_5 obj_30)
       (pred_10 obj_29)
       (pred_10 obj_16)
       (pred_10 obj_10)
       (pred_12 obj_23)
       (pred_12 obj_03)
       (pred_12 obj_19)

       (pred_8 obj_11 obj_18)
       (pred_8 obj_11 obj_22)
       (pred_8 obj_22 obj_26)
       (pred_8 obj_22 obj_01)
       (pred_8 obj_22 obj_11)
       (pred_8 obj_01 obj_14)
       (pred_8 obj_01 obj_24)
       (pred_8 obj_01 obj_22)
       (pred_8 obj_24 obj_05)
       (pred_8 obj_24 obj_04)
       (pred_8 obj_24 obj_01)
       (pred_8 obj_04 obj_21)
       (pred_8 obj_04 obj_24)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_26)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_26 obj_08)
       (pred_8 obj_26 obj_14)
       (pred_8 obj_26 obj_22)
       (pred_8 obj_26 obj_18)
       (pred_8 obj_14 obj_28)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_01)
       (pred_8 obj_14 obj_26)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_05 obj_21)
       (pred_8 obj_05 obj_24)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_21 obj_07)
       (pred_8 obj_21 obj_04)
       (pred_8 obj_21 obj_05)
       (pred_8 obj_02 obj_15)
       (pred_8 obj_02 obj_08)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_08 obj_20)
       (pred_8 obj_08 obj_28)
       (pred_8 obj_08 obj_26)
       (pred_8 obj_08 obj_02)
       (pred_8 obj_28 obj_13)
       (pred_8 obj_28 obj_12)
       (pred_8 obj_28 obj_14)
       (pred_8 obj_28 obj_08)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_12 obj_07)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_28)
       (pred_8 obj_07 obj_27)
       (pred_8 obj_07 obj_21)
       (pred_8 obj_07 obj_12)
       (pred_8 obj_15 obj_25)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_02)
       (pred_8 obj_20 obj_31)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_20 obj_08)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_13 obj_17)
       (pred_8 obj_13 obj_28)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_17 obj_27)
       (pred_8 obj_17 obj_12)
       (pred_8 obj_17 obj_13)
       (pred_8 obj_27 obj_30)
       (pred_8 obj_27 obj_07)
       (pred_8 obj_27 obj_17)
       (pred_8 obj_25 obj_31)
       (pred_8 obj_25 obj_15)
       (pred_8 obj_31 obj_09)
       (pred_8 obj_31 obj_20)
       (pred_8 obj_31 obj_25)
       (pred_8 obj_09 obj_06)
       (pred_8 obj_09 obj_13)
       (pred_8 obj_09 obj_31)
       (pred_8 obj_06 obj_30)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_09)
       (pred_8 obj_30 obj_27)
       (pred_8 obj_30 obj_06)
       (pred_4 obj_02)
       (pred_4 obj_25)
       (pred_4 obj_24)
       (pred_6  obj_02 obj_29)
       (pred_6  obj_25 obj_16)
       (pred_6  obj_24 obj_10)
       (pred_7 obj_11)
       (pred_7 obj_22)
       (pred_7 obj_01)
       (pred_7 obj_04)
       (pred_7 obj_18)
       (pred_7 obj_26)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_08)
       (pred_7 obj_28)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_7 obj_20)
       (pred_7 obj_13)
       (pred_7 obj_17)
       (pred_7 obj_27)
       (pred_7 obj_31)
       (pred_7 obj_09)
       (pred_7 obj_06)
       (pred_7 obj_30)

       (pred_9  obj_23 obj_29)
       (pred_9  obj_03 obj_16)
       (pred_9  obj_19 obj_10)
       (pred_2 obj_23 obj_21)
       (pred_2 obj_03 obj_01)
       (pred_2 obj_19 obj_14)
       (pred_11 obj_05)
    )

    (:goal (and
       (pred_2 obj_03 obj_26)
       (pred_2 obj_19 obj_31)
    ))
(:constraints
  (always (not (pred_11 obj_22)))
)
)

; plan
1. (op_2 obj_05 obj_14)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_14)
   goals met: 0 of 2
2. (op_4 obj_14 obj_19)
   deleted: (pred_2 obj_19 obj_14) (pred_1)
   added: (pred_3 obj_19)
   goals met: 0 of 2
3. (op_2 obj_14 obj_01)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_01)
   goals met: 0 of 2
4. (op_3 obj_01 obj_03 obj_19)
   deleted: (pred_3 obj_19) (pred_2 obj_03 obj_01)
   added: (pred_3 obj_03) (pred_2 obj_19 obj_01)
   goals met: 0 of 2
5. (op_2 obj_01 obj_14)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_14)
   goals met: 0 of 2
6. (op_2 obj_14 obj_26)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_26)
   goals met: 0 of 2
7. (op_1 obj_26 obj_03)
   deleted: (pred_3 obj_03)
   added: (pred_1) (pred_2 obj_03 obj_26)
   goals met: 1 of 2
8. (op_2 obj_26 obj_14)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_14)
   goals met: 1 of 2
9. (op_2 obj_14 obj_01)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_01)
   goals met: 1 of 2
10. (op_4 obj_01 obj_19)
   deleted: (pred_2 obj_19 obj_01) (pred_1)
   added: (pred_3 obj_19)
   goals met: 1 of 2
11. (op_2 obj_01 obj_14)
   deleted: (pred_11 obj_01)
   added: (pred_11 obj_14)
   goals met: 1 of 2
12. (op_2 obj_14 obj_26)
   deleted: (pred_11 obj_14)
   added: (pred_11 obj_26)
   goals met: 1 of 2
13. (op_2 obj_26 obj_08)
   deleted: (pred_11 obj_26)
   added: (pred_11 obj_08)
   goals met: 1 of 2
14. (op_2 obj_08 obj_20)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_20)
   goals met: 1 of 2
15. (op_2 obj_20 obj_31)
   deleted: (pred_11 obj_20)
   added: (pred_11 obj_31)
   goals met: 1 of 2
16. (op_1 obj_31 obj_19)
   deleted: (pred_3 obj_19)
   added: (pred_1) (pred_2 obj_19 obj_31)
   goals met: 2 of 2
